Subregions cannot intersect.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotIntersectSiteRegions { get; }
  Visual Basic
Public Shared ReadOnly Property CannotIntersectSiteRegions As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotIntersectSiteRegions {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SiteFailures Class
  Autodesk.Revit.DB Namespace